In [2]:
import pandas as pd
import numpy as np

In [23]:
cricket = {
    'team': ['India', 'Australia', 'England', 'New Zealand', 'South Africa', 'Pakistan', 'West Indies', 'Sri Lanka', 'Bangladesh'],
    'rank': [2, 1, 3, 4, 5, 7, 6, 8, 9],  # Rankings for each corresponding year
    'year': [2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015],
    'points': [112, 118, 105, 110, 100, 95, 88, 92, 85]
}

In [24]:
df=pd.DataFrame(cricket)

In [25]:
df

           team  rank  year  points
0         India     2  2015     112
1     Australia     1  2015     118
2       England     3  2015     105
3   New Zealand     4  2015     110
4  South Africa     5  2015     100
5      Pakistan     7  2015      95
6   West Indies     6  2015      88
7     Sri Lanka     8  2015      92
8    Bangladesh     9  2015      85

In [26]:
df.groupby('team').groups

{'Australia': [1], 'Bangladesh': [8], 'England': [2], 'India': [0], 'New Zealand': [3], 'Pakistan': [5], 'South Africa': [4], 'Sri Lanka': [7], 'West Indies': [6]}

In [27]:
df.groupby(['team','year']).get_group(('India',2015))

    team  rank  year  points
0  India     2  2015     112

1. Adding some statistical computation on the top of groupby

In [30]:
df.groupby('team')['points'].sum()

team
Australia       118
Bangladesh       85
England         105
India           112
New Zealand     110
Pakistan         95
South Africa    100
Sri Lanka        92
West Indies      88
Name: points, dtype: int64

In [34]:
df.groupby('team')['points'].mean()

team
Australia       118.0
Bangladesh       85.0
England         105.0
India           112.0
New Zealand     110.0
Pakistan         95.0
South Africa    100.0
Sri Lanka        92.0
West Indies      88.0
Name: points, dtype: float64

In [36]:
df.groupby('team')['points'].mean().sort_values()

team
Bangladesh       85.0
West Indies      88.0
Sri Lanka        92.0
Pakistan         95.0
South Africa    100.0
England         105.0
New Zealand     110.0
India           112.0
Australia       118.0
Name: points, dtype: float64

checek multiple stats for points time wise

In [40]:
group=df.groupby('team')

group['points'].agg([np.sum,np.mean,np.std,np.max,np.min])

              sum   mean  std  amax  amin
team
Australia     118  118.0  NaN   118   118
Bangladesh     85   85.0  NaN    85    85
England       105  105.0  NaN   105   105
India         112  112.0  NaN   112   112
New Zealand   110  110.0  NaN   110   110
Pakistan       95   95.0  NaN    95    95
South Africa  100  100.0  NaN   100   100
Sri Lanka      92   92.0  NaN    92    92
West Indies    88   88.0  NaN    88    88

filter function along with groupby

In [50]:
df.groupby('team').filter(lambda x: len(x)==1)

           team  rank  year  points
0         India     2  2015     112
1     Australia     1  2015     118
2       England     3  2015     105
3   New Zealand     4  2015     110
4  South Africa     5  2015     100
5      Pakistan     7  2015      95
6   West Indies     6  2015      88
7     Sri Lanka     8  2015      92
8    Bangladesh     9  2015      85